[
  {
    "name": "Sense",
    "src": "https://portafolio-angelo-amaro.s3.sa-east-1.amazonaws.com/proyectos/Sense.jpeg",
    "href": "https://github.com/ElNuVaTo/Sense",
    "skills": [
      "Solitario",
      "MongoDB",
      "Express",
      "React",
      "NodeJS"
    ],
    "desc": "En el proyecto individual para el Coding Dojo, tuve un tiempo límite de 2 semanas. La lección principal que aprendí fue la importancia de estimar adecuadamente el tiempo requerido para cada tarea. Aunque creé varias funciones, no pude completar el proyecto dentro del tiempo propuesto. Durante el desarrollo, me encontré aprendiendo cosas nuevas que no había tenido en cuenta inicialmente, lo cual afectó la viabilidad de la estimación."
  },
  {
    "name": "Pet Unite",
    "src": "https://portafolio-angelo-amaro.s3.sa-east-1.amazonaws.com/proyectos/Pet+Unite.jpg",
    "href": "https://github.com/orgs/Pet-Unite/repositories",
    "skills": [
      "Grupal",
      "MongoDB",
      "Express",
      "React",
      "NodeJS"
    ],
    "desc": "Proyecto grupal de Pet Unite para Coding Dojo, organicé al equipo y asigné tareas sin seguir un flujo de trabajo específico debido a la limitación de tiempo (2 semanas). Mi enfoque principal estuvo en el desarrollo del frontend, ya que trabajé en él de manera individual. Además, proporcioné asistencia resolviendo dudas en el backend de mis compañeros."
  },
  {
    "name": "Little Lemon",
    "src": "https://portafolio-angelo-amaro.s3.sa-east-1.amazonaws.com/proyectos/LittleLemon.jpg",
    "href": "https://github.com/ElNuVaTo/Little-Lemon",
    "skills": [
      "Solitario",
      "React"
    ],
    "desc": "Mi primer proyecto en solitario, aprendí mucho sobre la importancia de reutilizar y comprender el código. Inicialmente, el proyecto consistía en pocas funciones. Sin embargo, con el tiempo, el código se volvió difícil de mantener y recordar, ya que carecía de explicaciones claras. Esto generó dificultades para entender qué hacían algunas partes del código y dificultades para realizar modificaciones o mejoras."
  },
  {
    "name": "BonPland",
    "src": "https://portafolio-angelo-amaro.s3.sa-east-1.amazonaws.com/proyectos/NoPicture.png",
    "href": "https://github.com/orgs/Dev-Hive-DH/repositories",
    "skills": [
      "Grupal",
      "React"
    ],
    "desc": "Como líder en frontend, trabajé en un proyecto completo junto a un diseñador y un desarrollador backend. Utilizamos flujos de trabajo como Gitflow y convenciones de commits, siguiendo metodologías ágiles. Me enfoqué en convertir los diseños en código funcional, además de asignar tareas y resolver dudas en el frontend. Fomenté un ambiente colaborativo."
  }
]